{"<PAD>": 0, "<UNK>": 1, "aardvark": 2, "aardwolf": 3, "bongo": 4, "alpaca": 5, "civet": 6, "antelope": 7, "coatimundi": 8, "bluebird": 9, "flicker": 10, "boa_constrictor": 11, "asp": 12, "camel": 13, "bactrian_camel": 14, "cougar": 15, "puma": 16, "deer": 17, "coyote": 18, "degu": 19, "duck": 20, "eagle": 21, "grebe": 22, "eland": 23, "baboon": 24, "muskrat": 25, "elephant": 26, "capybara": 27, "gila_monster": 28, "felis_domesticus": 29, "plankton": 30, "gazelle": 31, "kudu": 32, "giraffe": 33, "mandrill": 34, "gray_diggers": 35, "squirrel": 36, "cormorant": 37, "gull": 38, "tern": 39, "hawk": 40, "kestrel": 41, "human": 42, "lion": 43, "jacana": 44, "mola_molas": 45, "dolphin": 46, "monkey": 47, "quetzal": 48, "mouse": 49, "osprey": 50, "parrotfish": 51, "wrasse": 52, "peccary": 53, "porcupine": 54, "echidna": 55, "raccoon": 56, "nutria": 57, "tapir": 58, "hippopotamus": 59, "tiger": 60, "turkey": 61, "chukar": 62, "vicuna": 63, "squid": 64, "zebra": 65, "bonobo": 66, "ape": 67, "gnu": 68, "crocodile": 69, "blue_goose": 70, "teal": 71, "gorilla": 72, "burro": 73, "wombat": 74, "chimpanzee": 75, "crab": 76, "isopod": 77, "dromedary": 78, "horse": 79, "platypus": 80, "elephant_seal": 81, "sea_anemone": 82, "gibbon": 83, "liger": 84, "leopard": 85, "groundhog": 86, "lemming": 87, "guinea_hen": 88, "hamster": 89, "impala": 90, "jackal": 91, "junco": 92, "kangaroo": 93, "ocelot": 94, "rabbit": 95, "kookaburra": 96, "worm": 97, "marmoset": 98, "koala": 99, "marmot": 100, "badger": 101, "cat": 102, "okapi": 103, "otter": 104, "parrot": 105, "hydra": 106, "rat": 107, "ermine": 108, "rhinoceros": 109, "salmon": 110, "smelt": 111, "sapsucker": 112, "falcon": 113, "bass": 114, "shark": 115, "skate": 116, "slug": 117, "varied_thrush": 118, "vole": 119, "wallaby": 120, "emu": 121, "walleye": 122, "sunfish": 123, "wapiti": 124, "elk": 125, "water_strider": 126, "katydid": 127, "slow_loris": 128, "woodpecker": 129, "albatross": 130, "flamingo": 131, "amphipod": 132, "copepod": 133, "barracuda": 134, "pumpkinseed": 135, "beetle": 136, "moth": 137, "sloth": 138, "buffalo": 139, "cow": 140, "calf": 141, "ewe": 142, "capuchin_monkey": 143, "chickadee": 144, "hummingbird": 145, "clownfish": 146, "beaver": 147, "jellyfish": 148, "coral": 149, "moose": 150, "puffin": 151, "chinchilla": 152, "donkey": 153, "drake": 154, "hen": 155, "fish": 156, "fisher": 157, "flatworm": 158, "ear_mite": 159, "robin": 160, "foal": 161, "colt": 162, "orangutan": 163, "guinea_pig": 164, "roly_poly": 165, "goat": 166, "guinea_worm": 167, "mosquito": 168, "hyena": 169, "karakul": 170, "grasshopper": 171, "alien": 172, "marsupial": 173, "marten": 174, "mountain_lion": 175, "mole": 176, "narwhal": 177, "porpoise": 178, "orca": 179, "panda": 180, "kiwi": 181, "pegasus": 182, "unicorn": 183, "penguin": 184, "meadowlark": 185, "pheasant": 186, "grouse": 187, "pig": 188, "polar_bear": 189, "polecat": 190, "bull": 191, "pony": 192, "prairie_dog": 193, "flounder": 194, "sable": 195, "seal": 196, "ant": 197, "sea_elephant": 198, "sheep": 199, "ray": 200, "snake": 201, "coney": 202, "sugar_glider": 203, "wildebeest": 204, "bear": 205, "african_wildcat": 206, "amoeba": 207, "anteater": 208, "hog": 209, "ass": 210, "dinosaur": 211, "bearded_dragon": 212, "turtle": 213, "bobcat": 214, "bird": 215, "blue_bird": 216, "cardinal": 217, "blue_whale": 218, "bluegill": 219, "scorpion": 220, "buck": 221, "jaguar": 222, "yak": 223, "canada_goose": 224, "dog": 225, "caribou": 226, "centipede": 227, "caterpillar": 228, "bunny": 229, "ferret": 230, "chipmunk": 231, "lemur": 232, "copperhead_snake": 233, "water_moccasin": 234, "seagull": 235, "dingo": 236, "mountain_goat": 237, "doe": 238, "heron": 239, "mallard_duck": 240, "meerkat": 241, "mink": 242, "finch": 243, "blue_jay": 244, "wren": 245, "fowl": 246, "frog": 247, "hedgehog": 248, "swan": 249, "gecko": 250, "gerbil": 251, "gnat": 252, "ladybug": 253, "shrew": 254, "goldfish": 255, "goose": 256, "tyrannosaurus_rex": 257, "gopher": 258, "grizzly_bear": 259, "kodiak_bear": 260, "halibut": 261, "tasmanian_devil": 262, "hermit_crab": 263, "leopard_ray": 264, "husky": 265, "iguana": 266, "alligator": 267, "komodo_dragon": 268, "weasel": 269, "lizard": 270, "lynx": 271, "jack_rabbit": 272, "mammoth": 273, "mongoose": 274, "opossum": 275, "nurse_shark": 276, "great_white_shark": 277, "boar": 278, "cheetah": 279, "panther": 280, "onyx": 281, "woodchuck": 282, "spider": 283, "oriole": 284, "ostrich": 285, "salamander": 286, "peregrine_falcon": 287, "pilot_fish": 288, "grouper": 289, "possum": 290, "sparrow": 291, "quail": 292, "mackerel": 293, "reindeer": 294, "rockfish": 295, "sturgeon": 296, "scallop": 297, "sea_lion": 298, "blue_herons": 299, "seahorse": 300, "skunk": 301, "wolf": 302, "flying_fish": 303, "swallow": 304, "stink_bug": 305, "trout": 306, "terrier": 307, "dalmatian": 308, "dragon": 309, "vulture": 310, "warthog": 311, "whale": 312, "white_bass": 313, "white_shark": 314, "haddock": 315, "owl": 316, "wolverine": 317, "fox": 318, "song_bird": 319, "weaver_bird": 320, "armadillo": 321, "bat": 322, "alaska_moose": 323, "bee": 324, "koala_bear": 325, "reptile": 326, "anaconda": 327, "angel_fish": 328, "angelfish": 329, "cricket": 330, "crow": 331, "eel": 332, "bison": 333, "llama": 334, "panda_bear": 335, "ox": 336, "pelican": 337, "pigeon": 338, "cockatiel": 339, "bald_eagle": 340, "golden_eagle": 341, "shrimp": 342, "northern_pike": 343, "dove": 344, "black_bear": 345, "canary": 346, "cub": 347, "kitten": 348, "teddy_bear": 349, "walrus": 350, "bug": 351, "butterfly": 352, "fly": 353, "cockroach": 354, "viper": 355, "wasp": 356, "beluga": 357, "cockatoo": 358, "lamb": 359, "mule": 360, "parakeet": 361, "python": 362, "cattle": 363, "octopus": 364, "black_labrador": 365, "labrador_retriever": 366, "black_widow": 367, "blue_heron": 368, "great_blue_heron": 369, "sperm_whale": 370, "sow": 371, "wildcat": 372, "box_turtle": 373, "snapping_turtle": 374, "brown_bear": 375, "budgie": 376, "bull_shark": 377, "chicken": 378, "bulldog": 379, "dachshund": 380, "clam": 381, "jackrabbit": 382, "pterodactyl": 383, "buzzard": 384, "turkey_buzzard": 385, "toad": 386, "catfish": 387, "flea": 388, "siamese_cat": 389, "yorkie": 390, "dragonfly": 391, "millipede": 392, "chameleon": 393, "snow_leopard": 394, "tiger_shark": 395, "chick": 396, "rattlesnake": 397, "chihuahua": 398, "snail": 399, "killer_whale": 400, "oyster": 401, "clown_fish": 402, "cobra": 403, "mastodon": 404, "cod": 405, "collie": 406, "golden_retriever": 407, "puppy": 408, "cone_snail": 409, "roadrunner": 410, "water_buffalo": 411, "wild_boar": 412, "lobster": 413, "crane": 414, "tarantula": 415, "blowfish": 416, "sting_ray": 417, "dodo": 418, "hound": 419, "st_bernard": 420, "manatee": 421, "tuna": 422, "peacock": 423, "raven": 424, "spider_monkey": 425, "african_elephant": 426, "fawn": 427, "hare": 428, "herring": 429, "sheep_dog": 430, "stingray": 431, "starfish": 432, "tortoise": 433, "rodent": 434, "german_shepherd": 435, "lungfish": 436, "hammerhead_shark": 437, "red_tailed_hawk": 438, "stork": 439, "tamarin": 440, "hornet": 441, "bronco": 442, "sea_otter": 443, "house_cat": 444, "howler_monkey": 445, "human_being": 446, "saber_tooth_tiger": 447, "bacteria": 448, "humpback_whale": 449, "kitty_cat": 450, "kitty": 451, "pug": 452, "laughing_hyena": 453, "moray_eel": 454, "newt": 455, "mammal": 456, "mockingbird": 457, "monster": 458, "mountain_sheep": 459, "mountain_cougars": 460, "insect": 461, "fruit_fly": 462, "musk_ox": 463, "lionfish": 464, "jack_ass": 465, "primate": 466, "stegosaurus": 467, "red_panda": 468, "river_otter": 469, "roach": 470, "jay": 471, "rooster": 472, "sea_turtle": 473, "sheepshead_fish": 474, "toucan": 475, "banana_slugs": 476, "cane_toad": 477, "spaniel": 478, "star_fish": 479, "stallion": 480, "starling": 481, "termite": 482, "triceratops": 483, "velociraptor": 484, "white_rhinoceros": 485, "wild_dog": 486, "wooly_mammoth": 487, "waterbug": 488, "red_birds": 489, "whooping_crane": 490, "moon_jelly": 491, "asian_elephant": 492, "little_green_herons": 493, "bumblebee": 494, "portuguese_man_of_war": 495, "cocker_spaniel": 496, "ram": 497, "axolotl": 498, "crystal_jelly": 499, "sand_dollar": 500, "tick_bug": 501, "lice": 502, "bengal_tiger": 503, "siberian_tiger": 504, "sea_urchin": 505, "tree_frog": 506, "brontosaurus": 507, "vampire_bat": 508, "yellow_jacket": 509}